In [2]:
import numpy as np
import pandas as pd

# Aula 27 Series

### Series são um tipo de dicionario

In [9]:
labels = ['a', 'b', 'c']
lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [13]:
series = pd.Series(data=lista, index=labels)

In [15]:
series

a    10
b    20
c    30
dtype: int64

In [17]:
series['b']

20

In [21]:
serie1 = pd.Series([1,2,3,4], index = ['EUA','Alemanha', 'URSS', 'Japão'])

In [26]:
serie1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [28]:
serie2 = pd.Series([1,2,3,4], index = ['EUA','Alemanha', 'Italia', 'Japão'])

In [31]:
serie2

EUA         1
Alemanha    2
Italia      3
Japão       4
dtype: int64

In [33]:
serie1 + serie2

Alemanha    4.0
EUA         2.0
Italia      NaN
Japão       8.0
URSS        NaN
dtype: float64

# Aula 28  DataFrame

In [38]:
np.random.seed(42)

In [47]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [49]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

### Separando por coluna

In [53]:
df['W']

A    0.738467
B   -1.478522
C    0.343618
D   -0.676922
E   -0.839218
Name: W, dtype: float64

In [57]:
df[['W','Z']]

          W         Z
A  0.738467 -0.301104
B -1.478522  1.057122
C  0.343618 -0.385082
D -0.676922  0.931280
E -0.839218  0.975545

In [59]:
df.W

A    0.738467
B   -1.478522
C    0.343618
D   -0.676922
E   -0.839218
Name: W, dtype: float64

In [61]:
df['NEW'] = df['W'] + df['X']

In [65]:
df

          W         X         Y         Z       NEW
A  0.738467  0.171368 -0.115648 -0.301104  0.909835
B -1.478522 -0.719844 -0.460639  1.057122 -2.198366
C  0.343618 -1.763040  0.324084 -0.385082 -1.419422
D -0.676922  0.611676  1.031000  0.931280 -0.065246
E -0.839218 -0.309212  0.331263  0.975545 -1.148430

In [75]:
df.drop('NEW', axis=1, inplace=True)

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

### Separando por indice

In [81]:
#df.loc['line','col']
df.loc['A','W']

0.7384665799954104

In [86]:
df.loc['A']

W    0.738467
X    0.171368
Y   -0.115648
Z   -0.301104
Name: A, dtype: float64

In [88]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.171368 -0.115648
B -0.719844 -0.460639

#### A diferença entre iloc é loc é que em iloc se usa números como indice, enquanto o loc pode usar o nome das colunas

In [94]:
df.iloc[1:3, 2:]

          Y         Z
B -0.460639  1.057122
C  0.324084 -0.385082

# Aula 29 Seleção Condicional

In [99]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [101]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [103]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False  False   True   True
C  False   True  False  False
D   True  False  False  False
E  False   True  False  False

In [105]:
bol = df > 0

In [107]:
df[bol]

          W         X         Y         Z
A  0.496714       NaN  0.647689  1.523030
B       NaN       NaN  1.579213  0.767435
C       NaN  0.542560       NaN       NaN
D  0.241962       NaN       NaN       NaN
E       NaN  0.314247       NaN       NaN

In [109]:
df[df['W']>0]

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
D  0.241962 -1.913280 -1.724918 -0.562288

In [120]:
df[df['W']>0]['Y']

A    0.647689
D   -1.724918
Name: Y, dtype: float64

In [129]:
df[(df['W'] > 0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [134]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.496714 -0.138264  0.647689  1.523030
1     B -0.234153 -0.234137  1.579213  0.767435
2     C -0.469474  0.542560 -0.463418 -0.465730
3     D  0.241962 -1.913280 -1.724918 -0.562288
4     E -1.012831  0.314247 -0.908024 -1.412304

In [136]:
df

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [138]:
col = 'SP, RS, RJ, AM, SC'.split()

In [140]:
df['Estado'] = col

In [142]:
df

          W         X         Y         Z Estado
A  0.496714 -0.138264  0.647689  1.523030    SP,
B -0.234153 -0.234137  1.579213  0.767435    RS,
C -0.469474  0.542560 -0.463418 -0.465730    RJ,
D  0.241962 -1.913280 -1.724918 -0.562288    AM,
E -1.012831  0.314247 -0.908024 -1.412304     SC

In [144]:
df.set_index('Estado', inplace=True)

In [146]:
df

               W         X         Y         Z
Estado
SP,     0.496714 -0.138264  0.647689  1.523030
RS,    -0.234153 -0.234137  1.579213  0.767435
RJ,    -0.469474  0.542560 -0.463418 -0.465730
AM,     0.241962 -1.913280 -1.724918 -0.562288
SC     -1.012831  0.314247 -0.908024 -1.412304

# Aula 30 - Indices Multiniveis

In [157]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [160]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [162]:
inside

[1, 2, 3, 1, 2, 3]

In [164]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [166]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [170]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [176]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A', 'B'])

In [178]:
df

             A         B
G1 1 -0.013497 -1.057711
   2  0.822545 -1.220844
   3  0.208864 -1.959670
G2 1 -1.328186  0.196861
   2  0.738467  0.171368
   3 -0.115648 -0.301104

In [182]:
df.loc['G1']

          A         B
1 -0.013497 -1.057711
2  0.822545 -1.220844
3  0.208864 -1.959670

In [186]:
df.loc['G1'].loc[1]

A   -0.013497
B   -1.057711
Name: 1, dtype: float64

In [188]:
df.index.names = ['Grupo', 'Teste']

In [190]:
df

                    A         B
Grupo Teste
G1    1     -0.013497 -1.057711
      2      0.822545 -1.220844
      3      0.208864 -1.959670
G2    1     -1.328186  0.196861
      2      0.738467  0.171368
      3     -0.115648 -0.301104

In [198]:
df.xs('G1')

              A         B
Teste
1     -0.013497 -1.057711
2      0.822545 -1.220844
3      0.208864 -1.959670

In [200]:
df.xs(1, level='Teste')

              A         B
Grupo
G1    -0.013497 -1.057711
G2    -1.328186  0.196861

# Aula 31 - Dados ausentes

In [205]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}

In [209]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [211]:
df = pd.DataFrame(d)

In [213]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [217]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [219]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [223]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [227]:
df.fillna(value='Fill Na')

         A        B  C
0      1.0      5.0  1
1      2.0  Fill Na  2
2  Fill Na  Fill Na  3

In [231]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [233]:
df.fillna(method='ffill')

C:\Users\merces\AppData\Local\Temp\ipykernel_7320\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

# Aula 32 - GroupBy

In [236]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [240]:
df = pd.DataFrame(data)

In [242]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [244]:
group = df.groupby('Empresa')

In [246]:
group

In [248]:
group.sum()

               Nome  Venda
Empresa
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [254]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [258]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [260]:
group = df.groupby('Nome')

In [262]:
group.sum()

        Empresa  Venda
Nome
Amy        MSFT    340
Carl         FB    243
Charlie    GOOG    120
Sam        GOOG    200
Sarah        FB    350
Vanessa    MSFT    124

# Aula 33 - Concatenacao

In [267]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [269]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [271]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [273]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [275]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [277]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [285]:
pd.merge(df1,df2,how='inner',on='C')

Empty DataFrame
Columns: [A_x, B_x, C, D_x, A_y, B_y, D_y]
Index: []

In [291]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [293]:
pd.merge(esquerda,direita,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [295]:
pd.merge(esquerda, direita, on=['key', 'key'])

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [297]:
pd.merge(esquerda, direita, how='outer', on=['key', 'key'])

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [302]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [304]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [306]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Aula 34 - Operações

In [309]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [311]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [313]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [315]:
df['col2'].nunique()

3

In [317]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [319]:
df2 = df[(df['col1']>2) & (df['col2']==444)]

In [321]:
df2

   col1  col2 col3
3     4   444  xyz

In [327]:
def mult(x):
    return x*2

In [329]:
df['col1'].apply(mult)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [331]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [333]:
df['col1'].sum()

10

In [335]:
del df['col1']

In [337]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [339]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [341]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [343]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [345]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [351]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [353]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Aula 35 Entrada e saida de dados

In [356]:
df = pd.read_csv('exemplo.csv')

In [358]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [360]:
df = df + 1

In [362]:
df

   Unnamed: 0   a   b   c   d
0           1   1   2   3   4
1           2   5   6   7   8
2           3   9  10  11  12
3           4  13  14  15  16

In [364]:
df.to_csv('exemplo1.csv', sep=';', decimal=',')

In [373]:
df1 = pd.read_excel('Exemplo_Excel.xlsx')

In [376]:
df1

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [378]:
df1.to_excel('teste.xlsx')

In [380]:
df1

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15